<template>
    <section class="faq section" data-faq="main" data-smooth-scrolling="faq">
        <div class="main-container max-width">
            <h2 class="title title--h2 title-reset">Частые вопросы о туре</h2>
            <div class="faq__wrap-cards">

                <Faq :faqs="faqs"/>

            </div>
        </div>
    </section>
</template>

<script>
  import Faq from "@/assets/components/Faq.vue";

export default {
    components: {
        Faq
    },

    setup() {

        return {
            faqs: [
                {
                    ask: "Когда и где старт маршрута?",
                    question: "Прилететь нужно 15 июля, 27 июля или 8 августа (в зависимости от выбранных дат), чтобы аклиматизироваться к смене часовых поясов. В 16:00 мы встречаем туристов организованно в аэропорту Елизово."
                },
                {
                    ask: "Будет ли телефонная связь на маршруте?",
                    question: "Местами связь будет прорываться в зависимости от оператора и погодных условий. Интернет почти не работает, но на стоянках есть возможность позвонить. Операторы Мегафон, МТС и Теле2."
                },
                {
                    ask: "Где мы будем жить в путешествии?",
                    question: "Пятый день маршрута предусмотрен с проживанием в комфортном хостеле. На активной части маршрута ночёвки предусмотрены в палатках. Палатки 2-х и 3-х местные, 2-х тамбурные. Расселяем по палатках семьи и компании вместе. Если Вы хотите жить отдельно, можете взять свою палатку."
                },
                {
                    ask: "Где мы будем жить до и после тура?",
                    question: "Для вашего удобства мы заранее забронировали проживание (день до тура и день после) в лучшем хостеле Петропавловска-Камчатского. А Для тех кто останется на Морскую прогулку 2 дня после тура."
                }
            ]
        };
    },
};

</script>

<style lang="scss">
    @import '@/assets/style/parts/components/faqs.scss'
</style>